src/Catalogs/ОСМИ_ЭлектронныеКарты/ОСМИ_ЭлектронныеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОСМИ_ЭлектронныеКарты</name>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ОСМИ_ШаблоныЭлектронныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьБаркод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьПодпись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПерсональнойСсылки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеференснаяЭлектроннаяКарта</name>
    <type>
      <types>CatalogRef.ОСМИ_ЭлектронныеКарты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоляКарты</name>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>46</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальныйИсточник</name>
      <type>
        <types>CatalogRef.ОСМИ_ИсточникиДанных</types>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ОСМИ_ЭлектронныеКарты/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ОбновитьКартуНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	Об.УстановитьЗначенияПолей();
	
	Карта = ОСМИ_РаботаСAPI.ЗапроситьИнформациюПокарте(Об.Код);
	
	Об.ПоляКарты.Очистить();
	
	Если Карта.Успех Тогда
		
		Для Каждого Значение  из Карта.Ответ.values Цикл
			Стр = Об.ПоляКарты.Добавить();
			Стр.Поле = Значение.label;
			Стр.Значение = Значение.value; 
		КонецЦикла;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(об,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКарту(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(, "Электронную карту необходимо сначала записать!");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Шаблон) Тогда
		ОбновитьКартуНаСервере();
	Иначе
		ПоказатьПредупреждение(,"Не выбран шаблон!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостьюДоступностью();
	
	Баркод = ОСМИ_ОбщиеСервер.ПолучитьБаркодДляЭлектроннойКарты(Объект.Ссылка);
	Карта = ОСМИ_ОбщиеСервер.Получить1СКарту(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ШаблонПриИзмененииНаСервере()
	
	Объект.ОтображатьБаркод = Объект.Шаблон.ОтображатьБаркод;
	Объект.ОтображатьПодпись = Объект.Шаблон.ОтображатьПодпись;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	
	ШаблонПриИзмененииНаСервере();
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	
	Если НЕ ЗначениеЗаполнено(Объект.Шаблон) Тогда
		Элементы.ГруппаБаркод.Видимость = Ложь;
	Иначе
		Элементы.ГруппаБаркод.Видимость = Истина;
		Элементы.Баркод.Видимость = Объект.Шаблон.ОтображатьБаркод ИЛИ Объект.Шаблон.ОтображатьПодпись;
		Элементы.ОтображатьБаркод.Видимость = Истина;
		Элементы.ОтображатьПодпись.Видимость = Истина;
		Элементы.ОтображатьБаркод.Доступность = Объект.Шаблон.ОтображатьБаркод;
		Элементы.ОтображатьПодпись.Доступность = Объект.Шаблон.ОтображатьПодпись;
	КонецЕсли;
		
КонецПроцедуры
